# CanHaveEmbeddedSchedule Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
ScheduleDefinition..::..CanHaveEmbeddedSchedule Method
ScheduleDefinition Class See Also
---
Indicates if this ScheduleDefinition can have an embedded ScheduleDefinition added.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool CanHaveEmbeddedSchedule()
```

Visual Basic
---
```text
Public Function CanHaveEmbeddedSchedule As Boolean
```

Visual C++
---
```text
public:
bool CanHaveEmbeddedSchedule()
```

# ### Return Value
True if this ScheduleDefinition can have an embedded ScheduleDefinition, false otherwise.
# Remarks
Only schedules of the following categories can have an embedded ScheduleDefinition:
  * Rooms
  * Spaces
  * Electrical Circuits
  * Duct Systems
  * Piping Systems

Key schedules cannot have embedded schedules.
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace